import { Component, OnInit } from '@angular/core';

@Component({
  selector: 'app-main',
  templateUrl: './main.component.html',
  styleUrls: ['./main.component.css']
})
export class MainComponent implements OnInit {

  constructor() { }
  news = [{
    'header':"შემთხვევითად გენერირებული ტექსტი ეხმარება დიზაინერებს",
    'description':"შემთხვევითად გენერირებული ტექსტი ეხმარება დიზაინერებს და ტიპოგრაფიული ნაწარმის მქმნელებს, რეალურთან მაქსიმალურად შემთხვევითად გენერირებული ტექსტი ეხმარება დიზაინერებს და ტიპოგრაფიული ნაწარმის მქმნელებს, რეალურთან მაქსიმალურად",
    'imageUrl': 'assets/images/banner.png',
    'date': '28 Aug, 2022'
  },
  {
    'header':"შემთხვევითად გენერირებული ტექსტი ეხმარება დიზაინერებს",
    'description':"შემთხვევითად გენერირებული ტექსტი ეხმარება დიზაინერებს და ტიპოგრაფიული ნაწარმის მქმნელებს, რეალურთან მაქსიმალურად შემთხვევითად გენერირებული ტექსტი ეხმარება დიზაინერებს და ტიპოგრაფიული ნაწარმის მქმნელებს, რეალურთან მაქსიმალურად",
    'imageUrl': 'assets/images/banner.png',
    'date': '28 Aug, 2022'
  },
  {
    'header':"შემთხვევითად გენერირებული ტექსტი ეხმარება დიზაინერებს",
    'description':"შემთხვევითად გენერირებული ტექსტი ეხმარება დიზაინერებს და ტიპოგრაფიული ნაწარმის მქმნელებს, რეალურთან მაქსიმალურად შემთხვევითად გენერირებული ტექსტი ეხმარება დიზაინერებს და ტიპოგრაფიული ნაწარმის მქმნელებს, რეალურთან მაქსიმალურად",
    'imageUrl': 'assets/images/banner.png',
    'date': '28 Aug, 2022'
  }]
  ngOnInit(): void {
  }

}
